In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv(r'A:\Work Docs\Data Analyst work\Campus X\10 Streamlit\Capstone\gurgoan_property.csv')

In [3]:
df.sample()

,property_name,property_type,society,price,price_per_sqft,area,areaWithType,bedRoom,bathroom,balcony,additionalRoom,address,floorNum,facing,agePossession,nearbyLocations,description,furnishDetails,features,rating
3712,4 Bedroom House for sale in Malibu Town,house,independent,0.99,17187.0,576.0,Plot area 64(53.51 sq.m.),4,4,3,not available,"Malibu Town, Gurgaon, Haryana",4.0,NaN,1 to 5 Year Old,"['Standard chartered ATM', 'Icici bank ATM', '...","Malibue towen in sector 47, 60 sq yard indepen...",[],"['Maintenance Staff', 'Rain Water Harvesting']","['Environment5 out of 5', 'Lifestyle4 out of 5..."

In [9]:
# Extracting sector form property name
df['property_name'].str.split('in').str.get(1).str.replace('Gurgaon', '').str.strip()[8]

'Sector 88B'

In [10]:
df.insert(loc=3,column='sector',value=df['property_name'].str.split('in').str.get(1).str.replace('Gurgaon', '').str.strip())

In [14]:
df.sample()

,property_name,property_type,society,sector,price,price_per_sqft,area,areaWithType,bedRoom,bathroom,...,additionalRoom,address,floorNum,facing,agePossession,nearbyLocations,description,furnishDetails,features,rating
2206,3 BHK Flat in ats marigold,flat,ats marigold,ats marigold,1.6,9142.0,1750.0,Super Built up area 1750(162.58 sq.m.),3,3,...,not available,"ats marigold, Gurgaon, Haryana",4.0,NaN,0 to 1 Year Old,"['Reliance Trends Newtown Square Mall', 'Dwark...",Premium lifestyle society with 3 rooms and 3 b...,[],"['Private Garden / Terrace', 'Swimming Pool', ...",NaN